from pymongo import MongoClient

client = MongoClient('localhost', 27017)

db = client["hotspot"]

coll = db['adminInfo']

info = {}

info['top'] = ['信息服务','公用事业','交运设备','食品饮料','餐饮旅游','纺织服装','采掘','综合','黑色金属','房地产','农林牧渔','电子','家用电器','轻工制造','金融服务','化工','商业贸易','机械设备','有色金属','医药生物','信息设备','建筑建材','交通运输']

info['secondary'] = ['旅游综合','渔业','光学光电子','证券','有色金属冶炼与加工','燃气','农业综合','园区开发','橡胶','物流','电气设备','多元金融','元件','塑料','非汽车交运设备','石油化工','公交','港口','仪器仪表','银行','机场','种植业','食品加工制造','贸易','畜禽养殖','采掘服务','饲料','化学纤维','景点','纺织制造','餐饮','医疗器械','金属制品','专用设备','通信运营','医疗服务','通用机械','生物制品','白色家电','化学制品','煤炭开采','其他电子','环保工程及服务','航空运输','汽车零部件','建筑装饰','医药商业','饮料制造','化学制药','高速公路','酒店','计算机设备','中药','电子制造','家用轻工','航运','石油开采','综合','电力','网络服务','通信设备','交运设备服务','动物保健','保险','零售','建筑材料','林业','计算机应用','钢铁','视听器材','传媒','包装印刷','化工新材料','其他采掘','化学原料','汽车整车','房地产开发','半导体','水务','农产品加工','铁路运输','金属非金属新材料','服装家纺','造纸']

info['source'] = ['客户需求', '行业新闻', '好专家']

info['stocksource'] = ['A股', '港股', '美股']

data = {'industry':info}

coll.insert_one(data)